source/blog/2018-04-18-os.org
#+TITLE: 操作系统
#+DATE: 2018-04-18
#+SETUPFILE: ~/blog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: notes
#+JEKYLL_TAGS: 学习笔记 
#+JEKYLL_PUBLISHED: true

* 引论
** 操作系统的目标
1. 提高硬件资源利用率
2. 方便用户使用
** 操作系统的作用
1. 对计算机资源进行抽象，作为计算机系统资源的管理者
2. 作为用户与计算机硬件系统之间的接口
** 操作系统的发展过程 
1. 人工操作阶段
2. 单道批处理系统
3. 多道批处理系统
4. 分时系统
** 操作系统的基本特征
并发，共享，虚拟和异步
* 进程管理
** 程序顺序执行时的特征
1. 顺序性：处理机严格按照程序规定顺序执行
2. 封闭性：程序执行时独占资源
3. 可再现性：只要程序执行时的环境和初始条件相同，当程序重复执行时都可以得到相同的结
   果
** 程序并发执行时的特征
1. 间断性：程序之间共享资源，形成相互制约的关系
2. 失去封闭性：由于共享资源
3. 不可再现性：由于程序并发执行失去了封闭性
** 进程实体的组成
程序段，相关的数据段，PCB（程序控制块）
** 进程的定义 
进程是进程实体的运行过程，是系统进行资源分配和调度的一个独立单位
** 进程的特征 
1. 动态性：进程实质是进程实体的执行过程
2. 并发性：引入进程的目的就是为了使进程实体间并发执行
3. 独立性：进程实体是一个能独立运行、独立获得资源和独立调度的基本单位
4. 异步性：进程按各自独立的、不可预知的速度向前推进
** 进程的状态
1. 就绪状态：进程已获得除CPU以外所有必要资源，只要获得CPU就可以运行的状态
2. 执行状态：进程获得CPU，程序正在执行的状态
3. 阻塞状态：正在执行的进程由于某事件暂时无法继续执行的状态
** PCB的作用 
1. 作为独立运行基本单位的标志
2. 能实现间断性运行方式
3. 提供进程管理所需要的信息
4. 提供进程调度所需要的信息
5. 实现与其它进程的同步与通信
** 进程控制块的组织方式 
1. 线性方式
2. 链接方式
3. 索引方式
