source/_posts/2018-04-18-os.html
---
title: "操作系统"
date: 2018-04-18
layout: post
categories: 
- notes
tags: 
- 学习笔记
published: true
comments: 
---

<div id="outline-container-org0f830f0" class="outline-2">
<h2 id="org0f830f0"><span class="section-number-2">1</span> 引论</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org693cb92" class="outline-3">
<h3 id="org693cb92"><span class="section-number-3">1.1</span> 操作系统的目标</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>提高硬件资源利用率</li>
<li>方便用户使用</li>
</ol>
</div>
</div>
<div id="outline-container-org31718f4" class="outline-3">
<h3 id="org31718f4"><span class="section-number-3">1.2</span> 操作系统的作用</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>对计算机资源进行抽象，作为计算机系统资源的管理者</li>
<li>作为用户与计算机硬件系统之间的接口</li>
</ol>
</div>
</div>
<div id="outline-container-org91d9a1b" class="outline-3">
<h3 id="org91d9a1b"><span class="section-number-3">1.3</span> 操作系统的发展过程</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>人工操作阶段</li>
<li>单道批处理系统</li>
<li>多道批处理系统</li>
<li>分时系统</li>
</ol>
</div>
</div>
<div id="outline-container-org25a3fd9" class="outline-3">
<h3 id="org25a3fd9"><span class="section-number-3">1.4</span> 操作系统的基本特征</h3>
<div class="outline-text-3" id="text-1-4">
<p>
并发，共享，虚拟和异步
</p>
</div>
</div>
</div>
<div id="outline-container-org2d08b4f" class="outline-2">
<h2 id="org2d08b4f"><span class="section-number-2">2</span> 进程管理</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0f05802" class="outline-3">
<h3 id="org0f05802"><span class="section-number-3">2.1</span> 程序顺序执行时的特征</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>顺序性：处理机严格按照程序规定顺序执行</li>
<li>封闭性：程序执行时独占资源</li>
<li>可再现性：只要程序执行时的环境和初始条件相同，当程序重复执行时都可以得到相同的结
果</li>
</ol>
</div>
</div>
<div id="outline-container-orgeca9113" class="outline-3">
<h3 id="orgeca9113"><span class="section-number-3">2.2</span> 程序并发执行时的特征</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>间断性：程序之间共享资源，形成相互制约的关系</li>
<li>失去封闭性：由于共享资源</li>
<li>不可再现性：由于程序并发执行失去了封闭性</li>
</ol>
</div>
</div>
<div id="outline-container-org2d51253" class="outline-3">
<h3 id="org2d51253"><span class="section-number-3">2.3</span> 进程实体的组成</h3>
<div class="outline-text-3" id="text-2-3">
<p>
程序段，相关的数据段，PCB（程序控制块）
</p>
</div>
</div>
<div id="outline-container-orge034404" class="outline-3">
<h3 id="orge034404"><span class="section-number-3">2.4</span> 进程的定义</h3>
<div class="outline-text-3" id="text-2-4">
<p>
进程是进程实体的运行过程，是系统进行资源分配和调度的一个独立单位
</p>
</div>
</div>
<div id="outline-container-orgbff6592" class="outline-3">
<h3 id="orgbff6592"><span class="section-number-3">2.5</span> 进程的特征</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>动态性：进程实质是进程实体的执行过程</li>
<li>并发性：引入进程的目的就是为了使进程实体间并发执行</li>
<li>独立性：进程实体是一个能独立运行、独立获得资源和独立调度的基本单位</li>
<li>异步性：进程按各自独立的、不可预知的速度向前推进</li>
</ol>
</div>
</div>
<div id="outline-container-org8cb28a5" class="outline-3">
<h3 id="org8cb28a5"><span class="section-number-3">2.6</span> 进程的状态</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>就绪状态：进程已获得除CPU以外所有必要资源，只要获得CPU就可以运行的状态</li>
<li>执行状态：进程获得CPU，程序正在执行的状态</li>
<li>阻塞状态：正在执行的进程由于某事件暂时无法继续执行的状态</li>
</ol>
</div>
</div>
<div id="outline-container-orga3fbb76" class="outline-3">
<h3 id="orga3fbb76"><span class="section-number-3">2.7</span> PCB的作用</h3>
<div class="outline-text-3" id="text-2-7">
<ol class="org-ol">
<li>作为独立运行基本单位的标志</li>
<li>能实现间断性运行方式</li>
<li>提供进程管理所需要的信息</li>
<li>提供进程调度所需要的信息</li>
<li>实现与其它进程的同步与通信</li>
</ol>
</div>
</div>
<div id="outline-container-org5192349" class="outline-3">
<h3 id="org5192349"><span class="section-number-3">2.8</span> 进程控制块的组织方式</h3>
<div class="outline-text-3" id="text-2-8">
<ol class="org-ol">
<li>线性方式</li>
<li>链接方式</li>
<li>索引方式</li>
</ol>
</div>
</div>
</div>
